01-关于jQuery
    ① JavaScript
        001 JavaScript是网景公司开发的一门脚本语言。
        002 JavaScript本身存在以下缺陷
            (1) 复杂的文档对象模型(DOM)操作
            (2) 不一致的浏览器实现和便捷的开发——"兼容问题"
            (3) 缺乏调试工具
    ② JavaScript库
        001 缘由：为了简化JavaScript的开发
        002 作用：JavaScript库封装了很多预定义的对象和实用函数，能帮助开发人员更轻松的开发且无需考虑浏览器兼容。
        003 常用库
            (1) prototype 最古老的库之一，大量扩展但结构松散
            (2) Dojo 增加大量本没有的功能
            (3) YUI 富交互网页程序工具集
            (4) MooTools 轻量、简洁、模块化和面向对象的JavaScript框架
            (5) jQuery   轻量，拥有强大的选择器，出色的DOM操作，可靠的事件处理，完善的兼容性和链式操作
        004 说明：每个JavaScript都各有优劣，看自己情况选择
    ③ jQuery简介
        001 诞生：2006年1月由John Resig创建的开源项目，托管于github网站。
        002 优势
            (1) 轻量级(30KB)
            (2) 拥有强大的选择器|出色的DOM操作|可靠的事件处理机制
            (3) 完善的Ajax
            (4) 出色的浏览器兼容性——能够在IE6+ FF 3.6 + Safari 5+ Opera Chrome等浏览器下正常运行
            (5) 链式操作让代码更优雅
            (6) 隐式迭代
            (7) 行为层和结构层分离 ——"可以直接给元素添加事件，使开发人员可以各司其职"
            (8) 丰富的插件|完善的文档|开源支持
        003 获取jQuery
官网：http://jquery.com/
托管：




